---
type: ButtonData
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# ButtonData

`Autodesk.Revit.UI.ButtonData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Image | — | `public ImageSource Image { get ; set ; }` |
| Property | LargeImage | — | `public ImageSource LargeImage { get ; set ; }` |
| Property | Text | — | `public string Text { get ; set ; }` |